## It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

 ## QUESTION 1 - 1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [5]:
 ## q1 -
df['FlightNumber'].fillna(value= df['FlightNumber'][0] + 10 , limit= 1, inplace= True)
df['FlightNumber'].fillna(value=df["FlightNumber"][2]+10 , limit = 1 , inplace= True)
 ## as the given column has dtype = float , we need to covert this to int64
df["FlightNumber"].dtype

dtype('float64')

In [6]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [7]:
## converting to int64
df["FlightNumber"] = df["FlightNumber"].astype(np.int64)

In [8]:
df["FlightNumber"].dtype

dtype('int64')

In [9]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

## QUESTION - 2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [12]:
df2 = pd.DataFrame(df['From_To'].str.split('_').to_list(),columns = ['From','To'])

In [13]:
df2

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

## Q NO - 3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [24]:
df2['From'] = df2['From'].str.capitalize()
df2 [ 'To'] = df2 ['To'].str.capitalize()

In [25]:
df2

       From         To     From
0    London      Paris    London
1    Madrid      Milan    Madrid
2    London  Stockholm    London
3  Budapest      Paris  Budapest
4  Brussels     London  Brussels

 ## Q. NO- 4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [26]:
df.drop(['From_To'] , inplace=True , axis = 1)

In [27]:
df

   FlightNumber  RecentDelays              Airline
0         10045      [23, 47]               KLM(!)
1         10055            []    <Air France> (12)
2         10065  [24, 43, 87]  (British Airways. )
3         10075          [13]       12. Air France
4         10085      [67, 32]          "Swiss Air"

In [28]:
df = pd.concat([df2,df],axis = 1 , sort = False)

In [30]:
df.drop(['From'],axis = 1)

          To     From   FlightNumber  RecentDelays              Airline
0      Paris    London         10045      [23, 47]               KLM(!)
1      Milan    Madrid         10055            []    <Air France> (12)
2  Stockholm    London         10065  [24, 43, 87]  (British Airways. )
3      Paris  Budapest         10075          [13]       12. Air France
4     London  Brussels         10085      [67, 32]          "Swiss Air"

## Q.NO - 5 5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.

In [31]:
R_delays = pd.DataFrame(df['RecentDelays'].to_list(),columns = ['delay1','delay2','delay3'])
R_delays

   delay1  delay2  delay3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [32]:
df.drop(['RecentDelays'], inplace=True,axis = 1)

In [33]:
df

       From         To     From   FlightNumber              Airline
0    London      Paris    London         10045               KLM(!)
1    Madrid      Milan    Madrid         10055    <Air France> (12)
2    London  Stockholm    London         10065  (British Airways. )
3  Budapest      Paris  Budapest         10075       12. Air France
4  Brussels     London  Brussels         10085          "Swiss Air"

In [34]:
df.insert(loc = 3, column = 'delay1' , value = R_delays['delay1'])
df.insert(loc = 4, column = 'delay2' , value = R_delays['delay2'])
df.insert(loc = 5, column = 'delay3' , value = R_delays['delay3'])
df

,From,To,From,delay1,delay2,delay3,FlightNumber,Airline
0,London,Paris,London,23.0,47.0,NaN,10045,KLM(!)
1,Madrid,Milan,Madrid,NaN,NaN,NaN,10055,<Air France> (12)
2,London,Stockholm,London,24.0,43.0,87.0,10065,(British Airways. )
3,Budapest,Paris,Budapest,13.0,NaN,NaN,10075,12. Air France
4,Brussels,London,Brussels,67.0,32.0,NaN,10085,"""Swiss Air"""